config/cf/Catalogs/Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Процессы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеВыполнениеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеВыполнениеЗаданияЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеВыполнениеЗаданияЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЭтапа</Name>
					<Comment>//0 - этап, 1 - подпроцесс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводПрошлыхИсполнителейВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафическаяСхема</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьНовогоИнициатораВНаблюдатели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИсполнителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИзменять</Name>
					<Comment>Если процесс был выбран ранее - то изменить его уже будет нельзя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьКомментарии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПереходитьНаЭтапыВыполненияБезУказанияРешений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЭтапа</Name>
					<Comment>// всегда подпроцесс</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗапретитьИзменятьДатуВыполнитьДо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУчетПоПроектам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НавСсылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подпроцесс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИсполнительЗадания</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребоватьПриПереводеНаСледующийЭтапИсполнителя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПереноситьИсполнителяИзПредыдущегоЭтапа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачальныйЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИсполнительЗадания</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсполнителиЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИсполнительЗадания</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АвтоматическоеВыполнение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/СостоянияЭтаповПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бэклог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подпроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/Процессы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = Неопределено;
	
	Если НЕ ЭтоГруппа Тогда
				
		// Делаем свертку по всем колонкам Исполнителей, чтобы не было дубляжа
		СтрокаСверки = "";
		Для каждого Стр Из ЭтотОбъект.Метаданные().ТабличныеЧасти.ИсполнителиЭтапов.Реквизиты Цикл
			Если НЕ ПустаяСтрока(СтрокаСверки) Тогда
				СтрокаСверки = СтрокаСверки + ",";
			КонецЕсли;
			СтрокаСверки = СтрокаСверки + Стр.Имя;
		КонецЦикла;
		ИсполнителиЭтапов.Свернуть(СтрокаСверки,);
		ИсполнителиЭтапов.Сортировать("Этап,Исполнитель");
		
		// Удаляем лишние этапы
		Индекс = ИсполнителиЭтапов.Количество();
		Пока Индекс > 0 И ИсполнителиЭтапов.Количество() > 0 Цикл
			Индекс = Индекс - 1;
			Этап = ИсполнителиЭтапов[Индекс].Этап;
			Если НЕ ЗначениеЗаполнено(Этап) Тогда
				ИсполнителиЭтапов.Удалить(Индекс);
				Продолжить;
			КонецЕсли;
			
			Найден = Ложь;
			Для каждого Строки Из ЭтапыПроцесса Цикл
				Если Строки.НачальныйЭтап = Этап ИЛИ Строки.КонечныйЭтап = Этап Тогда
					Найден = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Найден Тогда
				ИсполнителиЭтапов.Удалить(Индекс);
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Если Картинка.Получить() = Неопределено Тогда 
			Картинка = Новый ХранилищеЗначения(БиблиотекаКартинок.Подпроцесс);
		КонецЕсли;	
		
		Если Ссылка.Пустая() Тогда
			НовыйУИД = Новый УникальныйИдентификатор;
			НоваяСсылка = Справочники.Процессы.ПолучитьСсылку(НовыйУИД);
			УстановитьСсылкуНового(НоваяСсылка);		
			НавСсылка = ПолучитьНавигационнуюСсылку(НоваяСсылка, "Картинка");
		Иначе
			НавСсылка = ПолучитьНавигационнуюСсылку(ЭтотОбъект, "Картинка");
		КонецЕсли;
		
		ВидЭтапа = 1;
		
		Для каждого Строки Из Этапы Цикл
			Строки.НавСсылка = Строки.Этап.НавСсылка;
		КонецЦикла;
		
		СостояниеЭтапа = Перечисления.СостоянияЭтаповПроцесса.Подпроцесс;
		
		Если АвтоматическоеВыполнениеЗадания Тогда
			Если НЕ ЗначениеЗаполнено(АвтоматическоеВыполнениеЗаданияЭтап) Тогда
				// Не выбран этап
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, 
					"Объект.АвтоматическоеВыполнениеЗаданияЭтап",
					НСтр("ru = 'Не заполнен этап, который будет установлен при автоматическом выполнении задания'"),
					"Ошибки");
			Иначе
				// Проверка, что этап закрытия содержится в списке этапов процесса
				ЭтапНайден = Ложь;
				Для каждого Строки Из Этапы Цикл
					Если АвтоматическоеВыполнениеЗаданияЭтап = Строки.Этап Тогда
						ЭтапНайден = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если НЕ ЭтапНайден Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
						"Объект.Этапы",
						СтрШаблон(НСтр("ru = 'Этап автоматического выполнения <%1> не найден в списке этапов процесса'"), АвтоматическоеВыполнениеЗаданияЭтап),
						"Ошибки");					
				КонецЕсли;
				
				// Этап является закрывающим?
				Если АвтоматическоеВыполнениеЗаданияЭтап.СостояниеЭтапа <> Перечисления.СостоянияЭтаповПроцесса.Закрыт 
					И АвтоматическоеВыполнениеЗаданияЭтап.СостояниеЭтапа <> Перечисления.СостоянияЭтаповПроцесса.Выполнен Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
						"Объект.Этапы",
						СтрШаблон(НСтр("ru = 'Этап автоматического выполнения <%1> не является закрывающим (состояние этапа не равно Закрыт или Выполнен)'"), АвтоматическоеВыполнениеЗаданияЭтап),
						"Ошибки");					
				КонецЕсли;
			КонецЕсли;
			
			Если АвтоматическоеВыполнениеЗаданияЧасов = 0 Тогда
				// Не выбрано время закрытия
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
					"Объект.АвтоматическоеВыполнениеЗаданияЧасов",
					НСтр("ru = 'Не указано время автоматического выполнения задания'"),
					"Ошибки");
			КонецЕсли;			
		КонецЕсли;
	Иначе
		Если Картинка.Получить() = Неопределено Тогда 
			Картинка = Новый ХранилищеЗначения(БиблиотекаКартинок.Подсистема);
		КонецЕсли;	
		
		Если Ссылка.Пустая() Тогда
			НовыйУИД = Новый УникальныйИдентификатор;
			НоваяСсылка = Справочники.Процессы.ПолучитьСсылку(НовыйУИД);
			УстановитьСсылкуНового(НоваяСсылка);		
			НавСсылка = ПолучитьНавигационнуюСсылку(НоваяСсылка, "Картинка");
		Иначе
			НавСсылка = ПолучитьНавигационнуюСсылку(ЭтотОбъект, "Картинка");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
